"""Задания по стилю кода и именованию переменных."""

from math import
# напиши команду, которая проверяет, ссылаются ли

print(spam is eggs)
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None

active_students = []
# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым

students_count = 48
# назови переменную, которая хранит текущее количество студентов в потоке

min_range = 1
max_range = 45
# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45

import math
math.pi
round(math.pi, 9)
# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
